#### terraform plan every: 94f69e3
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.ssm.aws_ssm_parameter.consumer_secret: Refreshing state... [id=consumer_secret]
module.ssm.aws_ssm_parameter.v_aws_secret_access_key: Refreshing state... [id=v_aws_secret_access_key]
module.ssm.aws_ssm_parameter.consumer_key: Refreshing state... [id=consumer_key]
module.ssm.aws_ssm_parameter.v_aws_access_key_id: Refreshing state... [id=v_aws_access_key_id]
module.cloudwatch.aws_cloudwatch_log_group.main: Refreshing state... [id=/aws/ecs/discord-instagram-bot]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0219c5015d0627f06]
module.ecr.aws_ecr_repository.main: Refreshing state... [id=discord-instagram-bot]
aws_s3_bucket.discord-python-video: Refreshing state... [id=discord-python-video]
module.ssm.aws_ssm_parameter.sessionid: Refreshing state... [id=sessionid]
module.ssm.aws_ssm_parameter.mid: Refreshing state... [id=mid]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:cluster/discord-instagram-bot]
module.ssm.aws_ssm_parameter.token: Refreshing state... [id=token]
module.iam.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=EcsTaskRole-discord-instagram-bot]
module.iam.aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=EcsTaskRole-discord-instagram-bot:cloudwatch_logs]
module.iam.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_for_ecr: Refreshing state... [id=EcsTaskRole-discord-instagram-bot-20210515144659286700000001]
module.iam.aws_iam_role_policy.ecs_to_ssm: Refreshing state... [id=EcsTaskRole-discord-instagram-bot:ecs_to_ssm]
module.ecs.aws_ecs_task_definition.main: Refreshing state... [id=discord-instagram-bot-task-definition]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-0aed969abfb5a6b8a]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-0b3f607aa8028d7d7]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-0fb948f228d9d112f]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-0811d6780fa40db10]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-007456b5f4d45d89f]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-011f1a6e62c871778]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-0292c7a41f76eb5cf]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-09dfe003f37f6fa01]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0e45a090904c9ab1d]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-0b972285c43ef8586]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-07adf71781ae87ed1]
module.security.aws_security_group.alb: Refreshing state... [id=sg-0da582b80a2919b39]
module.security.aws_security_group.ecs: Refreshing state... [id=sg-086c267e1e2207c43]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b0ccfb579951dc58]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-086f9e70679e407a4]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a11d6b569f35e936]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-0730f79efc3000e03]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-0bab84d600257f8aa]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-06e92ec6691013325]
module.ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:service/discord-instagram-bot/discord-instagram-bot]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-0e45a090904c9ab1d1080289494]
aws_s3_bucket_policy.discord-python-video-policy: Refreshing state... [id=discord-python-video]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket.discord-python-image will be created
  + resource "aws_s3_bucket" "discord-python-image" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "discord-python-image"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "discord-python-image"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "discord-python-image"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
              + "POST",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # aws_s3_bucket_policy.discord-python-image-policy will be created
  + resource "aws_s3_bucket_policy" "discord-python-image-policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.ssm.aws_ssm_parameter.sessionid will be updated in-place
  ~ resource "aws_ssm_parameter" "sessionid" {
        id        = "sessionid"
        name      = "sessionid"
        tags      = {}
      ~ value     = (sensitive value)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

<details><summary>Show Plan Error</summary>

```terraform

```

</details>


*Pusher: @lazmond3, Action: `pull_request`*